---
kind: enumMember
id: F:Autodesk.Revit.DB.BoxPlacement.BottomLeft
enum: Autodesk.Revit.DB.BoxPlacement
source: html/2ecf1f45-4890-8b9f-3de7-8d0eebeb7ce7.htm
---
# Autodesk.Revit.DB.BoxPlacement.BottomLeft

Placement of a box by its bottom left corner.